name: "WSCNN with Average"
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "/$your_path/example/data/train.txt"
    batch_size: 100
	shuffle: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type:	"HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "/$your_path/example/data/valid.txt"
    batch_size: 200
  }
  include: { phase: TEST }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
	decay_mult: 1
  }
  param {
	lr_mult: 2
	decay_mult: 0
  }
  convolution_param {
	num_output: 16
    kernel_h: 1
	kernel_w: 24
	stride_h: 1
	stride_w: 1
	pad_h: 0
	pad_w: 12
	weight_filler {
	  type: "xavier" 
    }
	bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
	kernel_h: 1
	kernel_w: 183
	stride_h: 1
	stride_w: 1    
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
	decay_mult: 1
  }
  param {
	lr_mult: 2
	decay_mult: 0
  }
  convolution_param {
	num_output: 32
    kernel_h: 1
	kernel_w: 1
	stride_h: 1
	stride_w: 1
	weight_filler {
	  type: "xavier" 
    }
	bias_filler {
      type: "constant" 
      value: 0
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "drop1"
  type: "Dropout"
  bottom: "conv2"
  top: "conv2"
  dropout_param{
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 1
	decay_mult: 1
  }
  param {
	lr_mult: 2
	decay_mult: 0
  }
  convolution_param {
	num_output: 2
    kernel_h: 1
	kernel_w: 1
	stride_h: 1
	stride_w: 1
	weight_filler {
	  type: "xavier" 
    }
	bias_filler {
      type: "constant" 
      value: 0
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv3"
  top: "pool2"
  pooling_param {
    pool: AVE
	stride_h: 1
	stride_w: 1
	global_pooling: true
  }
}
layer {
	name: "flatten1"
	type: "Flatten"
	bottom: "pool2"
	top: "fc2"
}
layer {
  name: "loss6"
  type: "SoftmaxWithLoss"
  bottom: "fc2"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc2"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}
